b= []
for i in range(19):
    a = list(map(int, input().split()))
    b.append(a)
n= int(input())
xflip=[0 for i in range(19)]
yflip=[0 for i in range(19)]


for i in range(n):
    x, y = input().split()
    x=int(x)
    y=int(y)
    xflip[x-1]=(xflip[x-1]+1)%2
    yflip[y-1]=(yflip[y-1]+1)%2

for i in range(19):
    if(xflip[i]==1):
        for j in range(19):
            b[i][j]=(b[i][j]+1)%2

for i in range(19):
    if(yflip[i]==1):
        for j in range(19):
            b[j][i]=(b[j][i]+1)%2

for i in range(len(b)):
    a=b[i]
    for j in range(len(a)):
        print(b[i][j],end=" ")
    print()
'''


1. 첫번 째로 바둑 판을 입력 받고
2. 입력을 점의 개수를 받는다
3. 그 후 해당 개수만큼 점을 입력받는다

입력 받은 점을 기준으로 십자 라인을 가로로 한번 세로로 한번 뒤집는다
입력 받은 점은 가로한번 세로에서 한번 뒤집히기 때문에 결국 원상태로 복구된다

test case
0 0 0 0 0 0 0 0 0 1 0 1 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 1 0 1 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 1 0 1 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 1 0 1 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 1 0 1 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 1 0 1 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 1 0 1 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 1 0 1 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 1 0 1 0 0 0 0 0 0 0
1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
0 0 0 0 0 0 0 0 0 1 0 1 0 0 0 0 0 0 0
1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
0 0 0 0 0 0 0 0 0 1 0 1 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 1 0 1 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 1 0 1 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 1 0 1 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 1 0 1 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 1 0 1 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0 1 0 1 0 0 0 0 0 0 0
2
10 10
12 12
'''